## 1- Create a dataframe with merge

In [3]:
import pandas as pd
df1 = pd.DataFrame({
    'city' : ['new york', 'chicago', 'orlando'],
    'temperature' : [21, 14, 35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [4]:
df2 = pd.DataFrame({
    'city' : ['chicago', 'new york', 'orlando'],
    'humidity' : [65, 68, 75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

Create one simgle dataframe that contains the df1 and df2

In [5]:
df3 = pd.merge(df1, df2, on = 'city')
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## 2 - Create a dataframe with inner join

In [6]:
df1 = pd.DataFrame({
    'city' : ['new york', 'chicago', 'orlando', 'baltimore'],
    'temperature' : [21, 14, 35, 32],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           32

In [7]:
df2 = pd.DataFrame({
    'city' : ['chicago', 'new york', 'san francisco'],
    'humidity' : [65, 68, 71],
})
df2

            city  humidity
0        chicago        65
1       new york        68
2  san francisco        71

In [8]:
df3 = pd.merge(df1, df2, on = 'city')
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

The merge fuction will work with only the cities which it has some information because it works with intersection where the two dataframes must have the same name of the city or commom elements between the two datasets. It has as default the inner join

## 3 - Outer join

In [9]:
df3 = pd.merge(df1, df2, on = 'city', how = 'outer')
df3

            city  temperature  humidity
0       new york         21.0      68.0
1        chicago         14.0      65.0
2        orlando         35.0       NaN
3      baltimore         32.0       NaN
4  san francisco          NaN      71.0

With the outer selected the other cities will be included in the dataframe

## 4 - Left join

In [10]:
df3 = pd.merge(df1, df2, on = 'city', how = 'left')
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           32       NaN

It will take all the common elements between the two datasets  and also the remaining elements from the left dataframe. It is decided by the order in your merge call, df1 is left and df2 is right

## 5 - Right join

In [11]:
df3 = pd.merge(df1, df2, on = 'city', how = 'right')
df3

            city  temperature  humidity
0       new york         21.0        68
1        chicago         14.0        65
2  san francisco          NaN        71

## 6 - Look for the origin of the information

In [12]:
df3 = pd.merge(df1, df2, on = 'city', how = 'outer', indicator = True)
df3

            city  temperature  humidity      _merge
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2        orlando         35.0       NaN   left_only
3      baltimore         32.0       NaN   left_only
4  san francisco          NaN      71.0  right_only

## 7 - Merge with suffixes (to explicity the supply)

In [13]:
df1 = pd.DataFrame({
    'city' : ['new york', 'chicago', 'orlando', 'baltimore'],
    'temperature' : [21, 14, 35, 38],
    'humidity' : [65, 68, 71, 75],
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [15]:
df2 = pd.DataFrame({
    'city' : ['chicago', 'new york', 'san diego'],
    'temperature' : [23, 14, 35],
    'humidity' : [65, 68, 71]
})
df2

        city  temperature  humidity
0    chicago           23        65
1   new york           14        68
2  san diego           35        71

In [16]:
df3 = pd.merge(df1, df2, on = 'city')
df3

       city  temperature_x  humidity_x  temperature_y  humidity_y
0  new york             21          65             14          68
1   chicago             14          68             23          65

In [17]:
df3 = pd.merge(df1, df2, on = 'city', suffixes = ('_left', '_right'))
df3

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,21,65,14,68
1,chicago,14,68,23,65